БИТУправление_медицинским_центром_демо/src/InformationRegisters/СвязиМеждуКлиентами/СвязиМеждуКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиМеждуКлиентами</name>
  <resources>
    <name>ТипСвязи</name>
    <type>
      <types>CatalogRef.СтепениРодства</types>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент2</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ПаспортныеДанные/ПаспортныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПаспортныеДанные</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ДокументВид</name>
    <type>
      <types>CatalogRef.ДокументыУдостоверяющиеЛичность</types>
    </type>
  </resources>
  <resources>
    <name>ДокументСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументКемВыдан</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДокументКодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрацииПоМестуЖительства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <comment>Признак значения по умолчанию</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Произвольный комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <comment>Вспомогательное поле: &quot;Код страны&quot; или &quot;Индекс&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <comment>Вспомогательное поле: &quot;Код города&quot; или &quot;Регион&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <comment>Вспомогательное поле: &quot;Номер телефона&quot; или &quot;Район&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <comment>Вспомогательное поле: &quot;Внутренний (или добавочный)  номер&quot; или &quot;Город&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <comment>Вспомогательное поле: &quot;Населенный пункт&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <comment>Вспомогательное поле: &quot;Улица&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <comment>Вспомогательное поле: &quot;Дом&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <comment>Вспомогательное поле: &quot;Корпус&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <comment>Вспомогательное поле: &quot;Квартира&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <comment>Строковое представление контактной информации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <comment>Вспомогательное поле: &quot;Подъезд&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле11</name>
    <comment>Вспомогательное поле: &quot;Этаж&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле12</name>
    <comment>Вспомогательное поле: &quot;Код двери/домофон&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГородскойРайон</name>
    <comment>Городской район проживания</comment>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>КраткоеПредставление</name>
    <comment>Краткое представление</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект-владелец контактной информации</comment>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <comment>Тип контактной информации</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <comment>Вид контактной информации</comment>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ОбязательныеРеквизитыОбъектов/ОбязательныеРеквизитыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбязательныеРеквизитыОбъектов</name>
  <comment>Обязательные (при интерактивном вводе элемента) поля</comment>
  <resources>
    <name>ТолькоПриЗаписиНового</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИмяСправочника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметПроверки</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ПолФизическихЛиц/ПолФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолФизическихЛиц</name>
  <comment>Пол физических лиц</comment>
  <enumValues>
    <name>НеУказан</name>
    <comment>Пол не указан</comment>
  </enumValues>
  <enumValues>
    <name>Мужской</name>
    <comment>Пол мужской</comment>
  </enumValues>
  <enumValues>
    <name>Женский</name>
    <comment>Пол женский</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <comment>Типы контактной информации</comment>
  <enumValues>
    <name>Телефон</name>
    <comment>Телефон</comment>
  </enumValues>
  <enumValues>
    <name>Адрес</name>
    <comment>Адрес</comment>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <comment>E-Mail</comment>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <comment>Веб-страница</comment>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <comment>Другая контактная информация (произвольная)</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>Skype</name>
      <description>Skype</description>
    </items>
    <items>
      <name>АдресИностранный</name>
      <description>Адрес за пределами РФ</description>
    </items>
    <items>
      <name>АдресМестаРождения</name>
      <description>Адрес места рождения</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыДомашний</name>
      <description>Адрес электронной почты (личный)</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыРабочий</name>
      <description>Адрес электронной почты (рабочий)</description>
    </items>
    <items>
      <name>ВебСтраницаОрганизации</name>
      <description>Веб-страница организации</description>
    </items>
    <items>
      <name>ТелефонДомашний</name>
      <description>Домашний телефон</description>
    </items>
    <items>
      <name>ВебСтраницаФизЛица</name>
      <description>Домашняя веб-страница</description>
    </items>
    <items>
      <name>НомерПрочий</name>
      <description>Номер прочий</description>
    </items>
    <items>
      <name>АдресПочтовый</name>
      <description>Почтовый адрес</description>
    </items>
    <items>
      <name>ПрочаяИнформация</name>
      <description>Прочая информация</description>
    </items>
    <items>
      <name>ТелефонРабочий</name>
      <description>Рабочий телефон</description>
    </items>
    <items>
      <name>ТелефонСотовый</name>
      <description>Сотовый телефон</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ТелефонОрганизации</name>
      <description>Телефон организации</description>
    </items>
    <items>
      <name>Факс</name>
      <description>Факс</description>
    </items>
    <items>
      <name>АдресФактический</name>
      <description>Фактический адрес</description>
    </items>
    <items>
      <name>АдресЮридический</name>
      <description>Юридический адрес (адрес регистрации)</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <comment>Тип контактной информации</comment>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМаскуВвода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаВводаТелефонногоНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <comment>Не используется</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <comment>Не используется</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <comment>Не используется</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактируетсяВФормеОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/CommonForms/ФормаПоискаКлиентаУпр/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	ВидКарты = УчетнаяПолитика.ОсновнойВидМедКарт;
	МинДлинаСтрокиПоискаКлиента = УчетнаяПолитика.МинДлинаСтрокиПоискаКлиента;
	ВидДокумента = УчетнаяПолитика.ОсновнойВидДУЛ;
	
	ВидТелефона = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонСотовый");
	ВидАдреса	= ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресЮридический");
	
	Элементы.Телефон.Маска = ПолучитьМаскуВводаТелефона(ВидТелефона);
	Элементы.ПредставительТелефон.Маска = Элементы.Телефон.Маска;
	
	Представитель = ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка");
	ПредставительТипИзСправочника = Истина;
	Элементы.ПредставительТелефон.Видимость = Не ПредставительТипИзСправочника;
	Элементы.ГруппаПолис.Видимость = УчетнаяПолитика.ИспользоватьСтраховыеПолисы;
	
	ДокументУстановитьМаскуСерииНомераНаСервере();
	
	// Локализация
	ОсновнаяСтрана = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнаяСтрана");
	Если ОсновнаяСтрана = Справочники.СтраныМира.Россия Тогда
		Элементы.СНИЛС.Маска = МедицинскоеСтрахованиеКлиентСервер.МаскаСНИЛС();
	ИначеЕсли ЗначениеЗаполнено(ОсновнаяСтрана) Тогда
		Элементы.СНИЛС.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
 
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьНовогоКлиента(Команда)
	
	Если СтрДлина(СокрЛП(ФИО))<3 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Нельзя добавить клиента, т.к. не указано ФИО!'"));
		Возврат;
	КонецЕсли;
	
	Если Вопрос(НСтр("ru='Добавить нового клиента?'"),РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да Тогда
		
		СтруктураСправочника = Новый Структура("Ссылка, Фамилия, Имя, Отчество, ДатаРождения");
		мсЧастиФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФИО," ",Ложь);
		Если мсЧастиФИО.Количество()>=1 Тогда
			СтруктураСправочника.Фамилия = Трег(мсЧастиФИО[0]);
		КонецЕсли;
		Если мсЧастиФИО.Количество()>=2 Тогда
			СтруктураСправочника.Имя =Трег(мсЧастиФИО[1]);
		КонецЕсли;
		Если мсЧастиФИО.Количество()>=3 Тогда
			СтруктураСправочника.Отчество = Трег(мсЧастиФИО[2]);
		КонецЕсли;
		СтруктураСправочника.ДатаРождения = ДатаРождения;
		СтруктураСправочника.Ссылка = ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка");

		ДублиКлиента = ПолучитьДублиНовогоКлиента(СтруктураСправочника);
		Если ДублиКлиента.Количество() <> 0 Тогда
			ПараметрыФормы = Новый Структура("ДублиКлиента", ДублиКлиента);
			Ответ = ОткрытьФормуМодально("Справочник.Клиенты.Форма.РешениеОДублеКлиента", ПараметрыФормы);
			Если Ответ = "Отмена" Или Ответ = Неопределено Тогда
				Возврат;
			ИначеЕсли Ответ = "Отказ" Тогда
				ЭтаФорма.Закрыть();
				Возврат;
			ИначеЕсли ТипЗнч(Ответ) = Тип("СправочникСсылка.Клиенты") Тогда
				ЭтаФорма.Закрыть();
				ОповеститьОВыборе(Ответ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если Элементы.СНИЛС.Видимость
			И Не МедицинскаяДеятельностьКлиент.СНИЛС_КорректенПроверитьНаФорме(СНИЛС,, "СНИЛС")
		Тогда
			Возврат;
		КонецЕсли;
		
		СоздаватьМедкарту = УчетнаяПолитика.АвтоСозданиеМедкарт;
		Если Не СоздаватьМедкарту И ЗначениеЗаполнено(ВидКарты) Тогда
			Если Вопрос("Создать новую мед. карту?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				СоздаватьМедкарту = Истина;
			КонецЕсли;
		КонецЕсли;
		
		НовыйКлиент = СоздатьНовогоКлиентаСервер(ПараметрыСозданияКлиента(), СоздаватьМедкарту);
		Если НовыйКлиент <> Неопределено Тогда
			ОповеститьОВыбореКлиента(НовыйКлиент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Если Элементы.Результат.ТекущаяСтрока <> Неопределено Тогда
		ОповеститьОВыбореКлиента(Элементы.Результат.ТекущиеДанные.Клиент)
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСпискуКлиентов(Команда)
	
	ПараметрыФормы = Новый Структура("РежимВыбора", ВладелецФормы <> Неопределено);
	ОткрытьФорму("Справочник.Клиенты.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлиента(Команда)
	ТекДанные = Элементы.Результат.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СтруктураПараметров = Новый Структура("Ключ",ТекДанные.Клиент);
		ОткрытьФорму("Справочник.Клиенты.ФормаОбъекта",СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
 
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПоискОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ОбработкаПоискаПоФИО(Текст);
	ОпределитьПолПоФИОКлиента(Текст);
КонецПроцедуры

&НаКлиенте
Процедура ПоискАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ОбработкаПоискаПоФИО(Текст);
КонецПроцедуры

&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПустаяСсылка = ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка");
	
	Если СтруктураАдреса <> Неопределено Тогда 
		ЗначенияПолей = СтруктураАдреса;
		ЗначениеJSON = СтруктураАдресаJSON;
	Иначе
		ЗначенияПолей = КонтактнаяИнформацияСервер.ЗначенияПолейСГородомИзКэшаФилиала(ПустаяСсылка, ВидАдреса, глКэшАдресовФилиалов);
		ЗначениеJSON = Неопределено;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВидКонтактнойИнформации", ВидАдреса);
	ПараметрыОткрытия.Вставить("ЗначенияПолей", ЗначенияПолей);
	ПараметрыОткрытия.Вставить("Значение", ЗначениеJSON);
	ПараметрыОткрытия.Вставить("Представление",           Неопределено);
	ПараметрыОткрытия.Вставить("Объект",				  ПустаяСсылка);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаОповещенияЗаполненияКИ", ЭтаФорма, Новый Структура("Объект", ПустаяСсылка));
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия, Неопределено, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыбореКлиента(Элементы.Результат.ТекущиеДанные.Клиент);
КонецПроцедуры

&НаКлиенте
Процедура НомерКартыПриИзменении(Элемент)
	Элементы.ДекорацияИнфоНомерКарты.Видимость = НЕ ЗначениеЗаполнено(НомерКарты);
КонецПроцедуры

&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	
	Если Не ПустаяСтрока(ФИО) Тогда
 		мсФИОПоиск = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФИО," ",Ложь);
		ФИО = "";
 		Для Каждого эл из мсФИОПоиск Цикл
	 		ФИО = ФИО + строка(Трег(эл))+ " ";
		КонецЦикла;
		ФИО = СокрП(ФИО);
		ОпределитьПолПоФИОКлиента(ФИО);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПредставительТипПриИзменении(Элемент)
	Если ПредставительТипИзСправочника Тогда
		Представитель = ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка");	
	Иначе
		Представитель = "";
	КонецЕсли;
	Элементы.ПредставительТелефон.Видимость = Не ПредставительТипИзСправочника;
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	ДокументСерия = "";
	ДокументНомер = "";
	ДокументУстановитьМаскуСерииНомераКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументКемВыданНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Форма = ПолучитьФорму("ОбщаяФорма.ПодборУчрежденияВыдачиПаспорта", Новый Структура("КемВыдан", ДокументКемВыдан));
	Форма.КемВыдан = ДокументКемВыдан;
	КемВыдан = Форма.ОткрытьМодально();
	Если КемВыдан <> Неопределено Тогда
		ДокументКемВыдан = КемВыдан;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументКодПодразделенияПриИзменении(Элемент)
	
	Наименования = ДокументКодПодразделенияПриИзмененииНаСервере(ДокументКодПодразделения, ДокументДатаВыдачи);
	
	Если ТипЗнч(Наименования) = Тип("Строка") Тогда
		ДокументКемВыдан = Наименования;
	ИначеЕсли  ТипЗнч(Наименования) = Тип("Массив") Тогда
		спЗначений = Новый СписокЗначений();
		спЗначений.ЗагрузитьЗначения(Наименования);
		ДопПараметры = Новый Структура;
		Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтаФорма, ДопПараметры);
		ЭтаФорма.ПоказатьВыборИзСписка(Оповещение,спЗначений);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

 #Область СлужебныеПроцедурыИФункции 
 
&наКлиенте
Процедура ОповеститьОВыбореКлиента(Клиент)
	
	Если ВладелецФормы <> Неопределено Тогда
		ОповеститьОВыборе(Клиент);
	Иначе
		ПоказатьЗначение(, Клиент);
	КонецЕсли;
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры
 
 // При создании на сервере
&НаСервере
Процедура ДокументУстановитьМаскуСерииНомераНаСервере()

	Элементы.ДокументСерия.Видимость = Не ВидДокумента.НеИмеетСерию;
	Элементы.ДокументСерия.Маска = ВидДокумента.МаскаСерииДокумента;
	Элементы.ДокументНомер.Маска = ВидДокумента.МаскаНомераДокумента;
	Элементы.ДокументКодПодразделения.Маска = ВидДокумента.МаскаКодаПодразделения;

КонецПроцедуры

&НаКлиенте
Процедура ДокументУстановитьМаскуСерииНомераКлиент()
	
	ЗначенияРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ВидДокумента, "НеИмеетСерию, МаскаСерииДокумента, МаскаНомераДокумента, МаскаКодаПодразделения");
	
	Элементы.ДокументСерия.Видимость = Не ЗначенияРеквизитов.НеИмеетСерию;
	Элементы.ДокументСерия.Маска = ЗначенияРеквизитов.МаскаСерииДокумента;
	Элементы.ДокументНомер.Маска = ЗначенияРеквизитов.МаскаНомераДокумента;
	Элементы.ДокументКодПодразделения.Маска = ЗначенияРеквизитов.МаскаКодаПодразделения;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДублиНовогоКлиента(СтруктураСправочника)
	
	Возврат Справочники.Клиенты.ПолучитьДублирующихКлиентов(СтруктураСправочника);
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьНовогоКлиентаСервер(ДанныеКлиента, СоздаватьМедкарту = Ложь)
	
	// 1. Создание элемента справочника
	Объект = Справочники.Клиенты.СоздатьЭлемент();
	Объект.УстановитьНовыйКод();
	Объект.Наименование = ДанныеКлиента.ФИО;
	
	мсЧастиФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ДанныеКлиента.ФИО," ",Ложь);
	Если мсЧастиФИО.Количество()>=1 Тогда
		Объект.Фамилия = Трег(мсЧастиФИО[0]);
	КонецЕсли;
	Если мсЧастиФИО.Количество()>=2 Тогда
		Объект.Имя = Трег(мсЧастиФИО[1]);
	КонецЕсли;
	Если мсЧастиФИО.Количество()>=3 Тогда
		Объект.Отчество = Трег(мсЧастиФИО[2]);
	КонецЕсли;
	
	Объект.Наименование = РаботаСКлиентамиПереопределяемый.ПредставлениеПоФИО(Объект.Фамилия, Объект.Имя, Объект.Отчество);
	
	Объект.ДатаРождения = ДанныеКлиента.ДатаРождения;
	Объект.ИсточникИнформации = ДанныеКлиента.ИсточникИнформации;
	Пол = ДанныеКлиента.Пол;
	Если Не ЗначениеЗаполнено(Пол) Или Пол = Перечисления.ПолФизическихЛиц.НеУказан Тогда
		Пол = ОбщегоНазначения.ОпределитьПол(Объект.Имя, Объект.Фамилия, Объект.Отчество);
	КонецЕсли;
	Объект.Пол = Пол;
	
	Объект.СНИЛС = СтрЗаменить(СтрЗаменить(ДанныеКлиента.СНИЛС, " ", ""), "-", "");
	
	Если ДанныеКлиента.ГруппаСправочника.ЭтоГруппа Тогда
		Объект.Родитель = ДанныеКлиента.ГруппаСправочника.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКлиента.Представитель) Тогда
		Объект.ЗаконныйПредставитель = ДанныеКлиента.Представитель;
		Объект.ЗаконныйПредставительПримечание = ДанныеКлиента.ПредставительКомментарий;
		Если Не ДанныеКлиента.ПредставительТипИзСправочника Тогда
			Объект.ЗаконныйПредставительТелефон = ДанныеКлиента.ПредставительТелефон;
		КонецЕсли;
	КонецЕсли;
	
	Если СоздаватьМедкарту Тогда 
		ПараметрыМедкарты = Новый Структура;
		Если ЗначениеЗаполнено(ДанныеКлиента.ВидКарты) Тогда 
			ПараметрыМедкарты.Вставить("ВидКарты", ДанныеКлиента.ВидКарты);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеКлиента.НомерКарты) Тогда 
			ПараметрыМедкарты.Вставить("НомерКарты", ДанныеКлиента.НомерКарты);
		КонецЕсли;
		Объект.ДополнительныеСвойства.Вставить("СоздаватьМедкарту");
		Объект.ДополнительныеСвойства.Вставить("ПараметрыМедкарты", ПараметрыМедкарты);
	КонецЕсли;
	
	Отказ = Ложь;
	
	ТекстОшибки = ПроверитьЗаполнениеОбязательныхРеквизитовПередЗаписью(Отказ, Объект, ДанныеКлиента);
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Объект.Записать();
	
	Если ЗначениеЗаполнено(ДанныеКлиента.Представитель)
		И ЗначениеЗаполнено(ДанныеКлиента.ПредставительСтепеньРодства)
	Тогда
		ЗаписьРодство = РегистрыСведений.СвязиМеждуКлиентами.СоздатьМенеджерЗаписи();
		ЗаписьРодство.Клиент = Объект.Ссылка;
		ЗаписьРодство.Клиент2 = Объект.ЗаконныйПредставитель;
		ЗаписьРодство.ТипСвязи = ДанныеКлиента.ПредставительСтепеньРодства;
		ЗаписьРодство.Записать();
	КонецЕсли;
	
	
	НомерКарты = Объект.ОсновнаяМедицинскаяКарта.НомерКарты;
	ВидКарты = Объект.ОсновнаяМедицинскаяКарта.ВидКарты;
	
	// 2. Ввод контактной информации
	Телефон = СокрЛП(ДанныеКлиента.Телефон);
	Если ЗначениеЗаполнено(Телефон) Тогда
		КонтактнаяИнформацияСерверПереопределяемый.ЗаписатьНомерТелефона(
			Объект.Ссылка,
			Телефон,
			?(ДанныеКлиента.ВидТелефона.Пустая(), Справочники.ВидыКонтактнойИнформации.ТелефонСотовый, ДанныеКлиента.ВидТелефона));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКлиента.Адрес) Тогда
		
		Если ДанныеКлиента.ВидАдреса.Пустая() Тогда
			Вид	  = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
		Иначе
			Вид	  = ДанныеКлиента.ВидАдреса;
		КонецЕсли;
		
		КонтактнаяИнформацияСервер.ЗаписатьКонтактнуюИнформацию(Объект.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Вид, ДанныеКлиента.СтруктураАдреса, ДанныеКлиента.СтруктураАдресаJSON);
	КонецЕсли;
	
	// 3. Ввод паспортных данных
	Если ЗначениеЗаполнено(ДанныеКлиента.ДокументНомер) Тогда
	
		запПаспортныеДанные = РегистрыСведений.ПаспортныеДанные.СоздатьМенеджерЗаписи();
		запПаспортныеДанные.ФизЛицо = Объект.Ссылка;
		запПаспортныеДанные.ДокументВид				 = ДанныеКлиента.ВидДокумента;
		запПаспортныеДанные.ДокументСерия			 = ДанныеКлиента.ДокументСерия;
		запПаспортныеДанные.ДокументНомер			 = ДанныеКлиента.ДокументНомер;
		запПаспортныеДанные.ДокументДатаВыдачи		 = ДанныеКлиента.ДокументДатаВыдачи;
		запПаспортныеДанные.ДокументКемВыдан		 = ДанныеКлиента.ДокументКемВыдан;
		запПаспортныеДанные.ДокументКодПодразделения = ДанныеКлиента.ДокументКодПодразделения;
		запПаспортныеДанные.Период = ТекущаяДата();
	    запПаспортныеДанные.Записать();
		
	КонецЕсли; 
	
	// 4. Ввод данных полиса
	Если ЗначениеЗаполнено(ДанныеКлиента.ВидПолиса) Тогда
		
		Полис = Справочники.СтраховыеПолисы.СоздатьЭлемент();
		Полис.УстановитьНовыйКод();
		Полис.Владелец = Объект.Ссылка;
		Полис.ВидПолиса = ДанныеКлиента.ВидПолиса;
		Полис.Серия = ДанныеКлиента.ПолисСерия;
		Полис.Номер = ДанныеКлиента.ПолисНомер;
		Полис.СрокДействияНачало = ДанныеКлиента.ПолисСрокДействияНачало;
		Полис.СрокДействия = ДанныеКлиента.ПолисСрокДействия;
		Полис.НеДействителен = Ложь;
		Полис.Записать();
		Объект = Объект.Ссылка.ПолучитьОбъект();
		Объект.умцОсновнойСтраховойПолис = Полис.Ссылка;
		Объект.Записать();
		
	КонецЕсли; 
	
	Возврат Объект.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаПоискаПоФИО(Текст)
	
	Если Не ПустаяСтрока(Текст) И СтрДлина(Текст) >= МинДлинаСтрокиПоискаКлиента Тогда
		
		РезультатПоиска = ВыполнитьПоиск("ФИО",Текст);	
		Результат.Очистить();
		Для Каждого СтрокаРезультатаПоиска Из РезультатПоиска Цикл
			ЗаполнитьЗначенияСвойств(Результат.Добавить(), СтрокаРезультатаПоиска);
		КонецЦикла;
		
		Если Результат.Количество() <> 0 Тогда
			Элементы.Результат.ТекущаяСтрока = Результат[0].ПолучитьИдентификатор();
		Иначе
			ПереформироватьСтрокуФИОНового(Текст);
		КонецЕсли;
		
		Элементы.РезультатОткрытьКлиента.Доступность = (Результат.Количество() <> 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьПоиск(ПолеПоиска,Знач ЗначениеПоиска)
		
	мсНайденныеКлиенты = РаботаСФормамиСервер.ПолучитьМассивКлиентовПоАвтоподбору(ЗначениеПоиска, УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ИспользоватьАвтоПодборКлиентовПоКоду"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Клиент,
	|	Клиенты.Представление КАК Представление,
	|	Клиенты.ДатаРождения КАК ДатаРождения,
	|	ПРЕДСТАВЛЕНИЕ(Клиенты.ОсновнаяМедицинскаяКарта) КАК МедКарта
	|ПОМЕСТИТЬ Клиенты
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (КонтактнаяИнформация.Объект = Клиенты.Ссылка)
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|ГДЕ
	|	Клиенты.Ссылка В(&Клиенты)
	|	И НЕ Клиенты.ПометкаУдаления
	|	И НЕ Клиенты.Архив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиенты.Клиент,
	|	Клиенты.ДатаРождения КАК ДатаРождения,
	|	КонтактнаяИнформация.Представление КАК Телефон,
	|	КонтактнаяИнформация.Вид КАК ВидТелефона,
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотовый)
	|			ТОГДА 0
	|		КОГДА КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонРабочий)
	|			ТОГДА 1
	|		КОГДА КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонДомашний)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Приоритет,
	|	Клиенты.МедКарта КАК МедКарта,
	|	Клиенты.Представление КАК КлиентПредставление
	|ИЗ
	|	Клиенты КАК Клиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтактнаяИнформация.Объект = Клиенты.Клиент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиенты.Представление,
	|	Приоритет";
	Запрос.УстановитьПараметр("Клиенты",мсНайденныеКлиенты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатПоиска = РезультатЗапроса.Выгрузить();
	РезультатПоиска.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Позиция = мсНайденныеКлиенты.НайтиПоЗначению(Выборка.Клиент);
		Если Позиция <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(РезультатПоиска.Добавить(),Выборка);
			мсНайденныеКлиенты.Удалить(Позиция);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатПоиска);
	
КонецФункции

&НаКлиенте
Процедура ВидТелефонаПриИзменении(Элемент)
	
	Элементы.Телефон.Маска = ПолучитьМаскуВводаТелефона(ВидТелефона);
	Элементы.ПредставительТелефон.Маска = Элементы.Телефон.Маска;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияЗаполненияКИ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		СтруктураАдреса = Результат.КонтактнаяИнформация;
		СтруктураАдресаJSON = Результат.Значение;
		Адрес = Результат.Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереформироватьСтрокуФИОНового(Знач Текст)
	
	Если Не ПустаяСтрока(Текст) Тогда
		
		Пока Найти(Текст, "  ") Цикл
			Текст = СтрЗаменить(Текст, "  ", " ");
		КонецЦикла;
		
		Если КодСимвола(Текст,1)>=1025 И КодСимвола(Текст,1)<=1105 Или  КодСимвола(Текст,1)=32 Тогда		
			мсФИОПоиск = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Текст," ",Ложь);
			ФИО = "";
			Для Каждого эл Из мсФИОПоиск Цикл
				ФИО = ФИО + строка(Трег(эл))+ " ";
			КонецЦикла;
			ФИО = СокрП(ФИО);
		КонецЕсли
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьПолПоФИОКлиента(Текст)
	
	Если Не ПустаяСтрока(Текст) Тогда
		мсЧастиФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФИО," ",Ложь);
		
		Фамилия = "";
		Имя = "";
		Отчество = "";
		Если мсЧастиФИО.Количество() > 0 Тогда
			Фамилия = мсЧастиФИО[0];
		КонецЕсли;
		Если мсЧастиФИО.Количество() > 1 Тогда
			Имя = мсЧастиФИО[1];
		КонецЕсли;
		Если мсЧастиФИО.Количество() > 2 Тогда
			Отчество = мсЧастиФИО[2];
		КонецЕсли;
		
		Пол = ОбщегоНазначения.ОпределитьПол(Имя, Фамилия, Отчество);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМаскуВводаТелефона(ВидТелефона)

	Если ВидТелефона.ИспользоватьМаскуВвода Тогда
		Возврат ВидТелефона.МаскаВводаТелефонногоНомера;
	Иначе 
		Возврат "";
	КонецЕсли; 

КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьЗаполнениеОбязательныхРеквизитовПередЗаписью(Отказ, Объект, ДанныеКлиента)
	
	// Проверка заполненности обязательных полей элемента
	ОбъектСтруктура = ОбщегоНазначенияСервер.ПолучитьРеквизитыСсылки(Объект.Ссылка);
	ЗаполнитьЗначенияСвойств(ОбъектСтруктура, Объект);
	ОбъектСтруктура.Вставить("Ссылка", Объект.Ссылка);
	
	Если ЗначениеЗаполнено(ДанныеКлиента.Телефон) Тогда
		ДанныеПоля = РегистрыСведений.ОбязательныеРеквизитыОбъектов.ОписаниеПроверяемогоВидаКИ(ДанныеКлиента.ВидТелефона);
		ОбъектСтруктура.Вставить(ДанныеПоля.ИмяРеквизита, ДанныеКлиента.Телефон);	
		ОбъектСтруктура.Вставить("КонтактнаяИнформацияТелефон", ДанныеКлиента.Телефон);	
	КонецЕсли;
	
	ОбъектСтруктура.Вставить("КИПроверятьТолькоТелефоны", Истина);
	
	ТекстОшибки = РегистрыСведений.ОбязательныеРеквизитыОбъектов.ПроверитьЗаполненностьОбязательныхРеквизитов(ОбъектСтруктура, Объект.Ссылка.Пустая(), Отказ);
	
	Отказ = Отказ Или не ПустаяСтрока(ТекстОшибки);
	
	Возврат ТекстОшибки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДокументКодПодразделенияПриИзмененииНаСервере(КодУФМС, ДатаВыдачи)
	
	Возврат РегистрыСведений.ПаспортныеДанные.НаименованияПоКоду(КодУФМС, ДатаВыдачи);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеОкончания(ЗначениеВыбора, ДопПараметры) Экспорт
	
	Если НЕ (ЗначениеВыбора = Неопределено) Тогда
		ДокументКемВыдан = ЗначениеВыбора.Значение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПараметрыСозданияКлиента()
	
	ДанныеКлиента = Новый Структура;
	ДанныеКлиента.Вставить("ФИО", ФИО);
	ДанныеКлиента.Вставить("ДатаРождения", ДатаРождения);
	ДанныеКлиента.Вставить("ИсточникИнформации", ИсточникИнформации);
	ДанныеКлиента.Вставить("Пол", Пол);
	ДанныеКлиента.Вставить("СНИЛС", СНИЛС);
	ДанныеКлиента.Вставить("ГруппаСправочника", ГруппаСправочника);
	ДанныеКлиента.Вставить("Представитель", Представитель);
	ДанныеКлиента.Вставить("ПредставительТипИзСправочника", ПредставительТипИзСправочника);
	ДанныеКлиента.Вставить("ПредставительКомментарий", ПредставительКомментарий);
	ДанныеКлиента.Вставить("ПредставительТелефон", ПредставительТелефон);
	ДанныеКлиента.Вставить("ПредставительСтепеньРодства", ПредставительСтепеньРодства);
	ДанныеКлиента.Вставить("ВидКарты", ВидКарты);
	ДанныеКлиента.Вставить("НомерКарты", НомерКарты);
	ДанныеКлиента.Вставить("ВидТелефона", ВидТелефона);
	ДанныеКлиента.Вставить("Адрес", Адрес);
	ДанныеКлиента.Вставить("ВидАдреса", ВидАдреса);
	ДанныеКлиента.Вставить("СтруктураАдреса", СтруктураАдреса);
	ДанныеКлиента.Вставить("СтруктураАдресаJSON", СтруктураАдресаJSON);
	ДанныеКлиента.Вставить("ВидДокумента", ВидДокумента);
	ДанныеКлиента.Вставить("ДокументСерия", ДокументСерия);
	ДанныеКлиента.Вставить("ДокументНомер", ДокументНомер);
	ДанныеКлиента.Вставить("ДокументДатаВыдачи", ДокументДатаВыдачи);
	ДанныеКлиента.Вставить("ДокументКемВыдан", ДокументКемВыдан);
	ДанныеКлиента.Вставить("ДокументКодПодразделения", ДокументКодПодразделения);
	ДанныеКлиента.Вставить("ВидПолиса", ВидПолиса);
	ДанныеКлиента.Вставить("ПолисСерия", ПолисСерия);
	ДанныеКлиента.Вставить("ПолисНомер", ПолисНомер);
	ДанныеКлиента.Вставить("ПолисСрокДействияНачало", ПолисСрокДействияНачало);
	ДанныеКлиента.Вставить("ПолисСрокДействия", ПолисСрокДействия);
	ДанныеКлиента.Вставить("Телефон", Телефон);
	
	Возврат ДанныеКлиента;
	
КонецФункции

#КонецОбласти
